Lab_sessions/lab_04.org
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:nil
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:t todo:t |:t
#+title: R modelling. Lab session 04
#+date:
#+author: Daniel Ballesteros Chávez.
#+email: daniel@linuxdeb.home
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 27.1 (Org mode 9.3.6)
# +OPTIONS: html-style:nil

# Daniel Ballesteros-Chávez

#+HTML_HEAD: <style type="text/css"> tr:nth-child(odd) {background-color: #e2e2e2;}  tr:first-child {font-weight: bold}  tr:hover {background-color: #d0c6e5;}</style>
#+HTML_HEAD: <style> pre.src { overflow: auto; }</style>
#+HTML_HEAD: <style> .mmbox {background-color: #BFF2FF; padding: 10px 20px 10px 20px; }</style>
#+HTML_HEAD_EXTRA: <style>code {background-color: #ccc}</style>

:results:
#+HTML_HEAD:<style> /* Daniel Ballesteros-Chavez */
#+HTML_HEAD:
#+HTML_HEAD: :root {
#+HTML_HEAD:   --col0: #2b2d42;		/*Top bar*/
#+HTML_HEAD:   --col1: #8d99ae;		/* Section header bg*/
#+HTML_HEAD:   --col2: #edf2f4;		/*body bg*/
#+HTML_HEAD:   --col3: #ef233c;		/*Active top bar*/
#+HTML_HEAD:   --col4: #d90429;		/*Home botton bg*/
#+HTML_HEAD:   --col5: #173f5f;			/*H2 header*/
#+HTML_HEAD:
#+HTML_HEAD: }
#+HTML_HEAD:
#+HTML_HEAD: body {
#+HTML_HEAD:     /*    background-image: url('./Images/bgpic.jpg'); */
#+HTML_HEAD:     background-size: cover;
#+HTML_HEAD:     background-attachment: fixed;
#+HTML_HEAD:	font-family: Helvetica;
#+HTML_HEAD:     /* background-position: left top; */
#+HTML_HEAD:     /* background-repeat: no-repeat; */
#+HTML_HEAD:     background: var(--col2);
#+HTML_HEAD:     margin: 20px auto; /* "auto" for centering */
#+HTML_HEAD:     max-width: 768px;
#+HTML_HEAD:     /* max-width: 800px; */
#+HTML_HEAD:     /* font-family: monospace; */
#+HTML_HEAD: }
#+HTML_HEAD:
#+HTML_HEAD: h1 {
#+HTML_HEAD:     display: block;
#+HTML_HEAD:     font-size: 1.5em;
#+HTML_HEAD:     /* margin-top: 0.67em; */
#+HTML_HEAD:     /* margin-bottom: 0.67em; */
#+HTML_HEAD:     margin-left: 0;
#+HTML_HEAD:     margin-right: 0;
#+HTML_HEAD:     font-weight: bold;
#+HTML_HEAD:     color: var(--col0);
#+HTML_HEAD:     padding: 5px 20px;
#+HTML_HEAD:     /*    background-color:#092B39;*/
#+HTML_HEAD:     /*text-align: center; */
#+HTML_HEAD:     /*text-shadow: 3px 2px gray;*/
#+HTML_HEAD: }
#+HTML_HEAD:
#+HTML_HEAD: h2 {
#+HTML_HEAD:     display: block;
#+HTML_HEAD:     font-size: 1em;
#+HTML_HEAD:     margin-top: 0.67em;
#+HTML_HEAD:     margin-bottom: 0.67em;
#+HTML_HEAD:     margin-left: 0;
#+HTML_HEAD:     margin-right: 0;
#+HTML_HEAD:     font-weight: bold;
#+HTML_HEAD:     color: var(--col0);
#+HTML_HEAD:     background-color: var(--col1);
#+HTML_HEAD:     border-radius: 10px 10px;
#+HTML_HEAD:     padding: 10px 20px;
#+HTML_HEAD:     /*    background-color:#092B39;*/
#+HTML_HEAD: }
#+HTML_HEAD:
#+HTML_HEAD: div.outline-2 {
#+HTML_HEAD:     background-color: var(--col2);
#+HTML_HEAD:     /* border:3px solid #f2f6f9; */
#+HTML_HEAD:     color: var(--col0);
#+HTML_HEAD: }
#+HTML_HEAD:
#+HTML_HEAD: div.outline-2 h2 {
#+HTML_HEAD:     color: var(--col5);
#+HTML_HEAD:     font-size: 20px; /* arial, sans-serif; */
#+HTML_HEAD:     /* font-family: 'Fredoka One', cursive; */
#+HTML_HEAD: }
#+HTML_HEAD:
#+HTML_HEAD:
#+HTML_HEAD: div.outline-text-2 {
#+HTML_HEAD: }
#+HTML_HEAD:
#+HTML_HEAD: div.outline-text-2 p {
#+HTML_HEAD:     text-align: justify;
#+HTML_HEAD: }
#+HTML_HEAD:
#+HTML_HEAD: </style>
:end:

* Introduction

The main objective of this practice is that you feel comfortable writing code in 'Markdown' and to produce
human readable documents.

We should be able to write simple mathematical expressions using syntax like
#+begin_example
This is an inline equation $f(x) = 2^3 + \frac{x}{\sqrt{x^2 +1}}$.

Also by declaring an equation like the following:
\begin{equation}
e^x = \lim_{x\to \infty} \left( 1  + \frac{x}{n}\right)^{n}
\end{equation}
#+end_example

To obtain something like
\begin{equation}
e^x = \lim_{x\to \infty} \left( 1  + \frac{x}{n}\right)^{n}.
\end{equation}



Make sure you can produce your html, pdf or doc file for it will be needed for the following session.

* Practice 1

Go to the following website

 https://rmarkdown.rstudio.com/

1) Install the package "rmarkdown"

2) Create the file ~lab_04_solutions.Rmd~, title: R lab 04 Solutions, author: your name, section 1: The hello world program.

3) Export to html. Make sure that both the code and the results are shown in the output file.


* Practice 2

Add in the section 2 of your ~Rmd~ file the definition of the arithmetic mean using ~latex~ syntax.
and compute the (arithmetic) mean of the following sequence of numbers:

+  $\{6,9,4,3,4,9,4,2,7,3,5,4,7,1,3,5,1,7,3,4,7,9,7,2,9,1,8,2,7,4 \}$


* Practice 3

Add in the section 3 of your ~Rmd~ file the definition of both, population variance and sample variance.
Use the function ~var()~ to the sequence

+ $\{ 5,3,3,2,4,4,8,9,6,1,10,8,5,2,5,2,4,10,6,3,1,9,3,4,1,9,10,7,1,7 \}$

+ What kind of variance the function ~var~ is performing? population variance or sample variance?


* Practice 4

Add section 4 to your ~Rmd~ file. Use the data set ~diamondsCSV.csv~ to print the table summarising
the average prices of a diamond by cut type and colour. (see Practice 1 of previous lab).

+ Make sure that the table is shown accordingly in the exported html file.

* Practice 5

Add section 5 to your ~Rmd~ file. Explain what is an /outlier/. Run the following command:  ~plot(iris$Sepal.Width ~ iris$Species)~.  

+ Explain the output and make sure the plot appears in the html file.


* Practice 6

Read the output of the help command ~?Normal~. This is a description of the R functions related
to the The Normal Distribution.

+ Copy form this documentation the mathematical expression for the the
  normal distribution density function and add it to your document.

Use the following sequence ~X <- seq(-3,3,by=0.2)~.

From the plots

#+begin_example R
plot(X,dnorm(X),type="l")

plot(X,pnorm(X),type="l")
#+end_example

 + Decide which function corresponds to a Probability Density
   function, and which one corresponds to a Cummulative Distribution
   Function. (See Lecture 2 for the definitions we are using).

+ Make sure the images are rendered correctly in the html file.




