Lab_sessions/lab_04.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-10-25 Tue 11:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>R modelling. Lab session 04</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Daniel Ballesteros Chávez." />
</head>
<body>
<div id="content">
<h1 class="title">R modelling. Lab session 04</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2f7a761">Introduction</a></li>
<li><a href="#orgd5c56a9">Practice 1</a></li>
<li><a href="#org4f3b4ef">Practice 2</a></li>
<li><a href="#org2d5efcb">Practice 3</a></li>
<li><a href="#orgae4c45d">Practice 4</a></li>
<li><a href="#orgd82995a">Practice 5</a></li>
<li><a href="#org16283c1">Practice 6</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2f7a761" class="outline-2">
<h2 id="org2f7a761">Introduction</h2>
<div class="outline-text-2" id="text-org2f7a761">
<p>
The main objective of this practice is that you feel comfortable writing code in 'Markdown' and to produce
human readable documents.
</p>

<p>
We should be able to write simple mathematical expressions using syntax like
</p>
<pre class="example">
This is an inline equation $f(x) = 2^3 + \frac{x}{\sqrt{x^2 +1}}$.

Also by declaring an equation like the following:
\begin{equation}
e^x = \lim_{x\to \infty} \left( 1  + \frac{x}{n}\right)^{n}
\end{equation}
</pre>

<p>
To obtain something like
</p>
\begin{equation}
e^x = \lim_{x\to \infty} \left( 1  + \frac{x}{n}\right)^{n}.
\end{equation}



<p>
Make sure you can produce your html, pdf or doc file for it will be needed for the following session.
</p>
</div>
</div>

<div id="outline-container-orgd5c56a9" class="outline-2">
<h2 id="orgd5c56a9">Practice 1</h2>
<div class="outline-text-2" id="text-orgd5c56a9">
<p>
Go to the following website
</p>

<p>
<a href="https://rmarkdown.rstudio.com/">https://rmarkdown.rstudio.com/</a>
</p>

<ol class="org-ol">
<li>Install the package "rmarkdown"</li>

<li>Create the file <code>lab_04_solutions.Rmd</code>, title: R lab 04 Solutions, author: your name, section 1: The hello world program.</li>

<li>Export to html. Make sure that both the code and the results are shown in the output file.</li>
</ol>
</div>
</div>


<div id="outline-container-org4f3b4ef" class="outline-2">
<h2 id="org4f3b4ef">Practice 2</h2>
<div class="outline-text-2" id="text-org4f3b4ef">
<p>
Add in the section 2 of your <code>Rmd</code> file the definition of the arithmetic mean using <code>latex</code> syntax.
and compute the (arithmetic) mean of the following sequence of numbers:
</p>

<ul class="org-ul">
<li>\(\{6,9,4,3,4,9,4,2,7,3,5,4,7,1,3,5,1,7,3,4,7,9,7,2,9,1,8,2,7,4 \}\)</li>
</ul>
</div>
</div>


<div id="outline-container-org2d5efcb" class="outline-2">
<h2 id="org2d5efcb">Practice 3</h2>
<div class="outline-text-2" id="text-org2d5efcb">
<p>
Add in the section 3 of your <code>Rmd</code> file the definition of both, population variance and sample variance.
Use the function <code>var()</code> to the sequence
</p>

<ul class="org-ul">
<li>\(\{ 5,3,3,2,4,4,8,9,6,1,10,8,5,2,5,2,4,10,6,3,1,9,3,4,1,9,10,7,1,7 \}\)</li>

<li>What kind of variance the function <code>var</code> is performing? population variance or sample variance?</li>
</ul>
</div>
</div>


<div id="outline-container-orgae4c45d" class="outline-2">
<h2 id="orgae4c45d">Practice 4</h2>
<div class="outline-text-2" id="text-orgae4c45d">
<p>
Add section 4 to your <code>Rmd</code> file. Use the data set <code>diamondsCSV.csv</code> to print the table summarising
the average prices of a diamond by cut type and colour. (see Practice 1 of previous lab).
</p>

<ul class="org-ul">
<li>Make sure that the table is shown accordingly in the exported html file.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd82995a" class="outline-2">
<h2 id="orgd82995a">Practice 5</h2>
<div class="outline-text-2" id="text-orgd82995a">
<p>
Add section 5 to your <code>Rmd</code> file. Explain what is an <i>outlier</i>. Run the following command:  <code>plot(iris$Sepal.Width ~ iris$Species)</code>.  
</p>

<ul class="org-ul">
<li>Explain the output and make sure the plot appears in the html file.</li>
</ul>
</div>
</div>


<div id="outline-container-org16283c1" class="outline-2">
<h2 id="org16283c1">Practice 6</h2>
<div class="outline-text-2" id="text-org16283c1">
<p>
Read the output of the help command <code>?Normal</code>. This is a description of the R functions related
to the The Normal Distribution.
</p>

<ul class="org-ul">
<li>Copy form this documentation the mathematical expression for the the
normal distribution density function and add it to your document.</li>
</ul>

<p>
Use the following sequence <code>X &lt;- seq(-3,3,by=0.2)</code>.
</p>

<p>
From the plots
</p>

<pre class="example">
plot(X,dnorm(X),type="l")

plot(X,pnorm(X),type="l")
</pre>

<ul class="org-ul">
<li>Decide which function corresponds to a Probability Density
function, and which one corresponds to a Cummulative Distribution
Function. (See Lecture 2 for the definitions we are using).</li>
</ul>
<ul class="org-ul">
<li>Make sure the images are rendered correctly in the html file.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Ballesteros Chávez.</p>
<p class="date">Created: 2022-10-25 Tue 11:02</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
